1s/ERP/Conf/Documents/Лико_ЗаявкаНаОтгрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ЗаявкаНаОтгрузку</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Лико_ПараметрыОтрузки</xr:Item>
				<xr:Item>AccumulationRegister.Лико_ЗаявкиНаОтгрузку</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ТипыЗаявокНаТранспортировку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_СостоянияЗаявокНаТранспортировку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>оставил как служебный реквизит для префиксации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОтгрузки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ТипыОтгрузкиГотовойПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияПродавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданаНаОснованииЗаданияНаСписаниеГП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловияПоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Comment>Для склада лк Металлострой ГП - Ликофлекс, для склада ИКС ГП - ИксПак</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ШаблоныЗаявокНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданаИзЗаказаСчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказКлиента</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_НомераПоставок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаЦены</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресДоставки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресДоставкиЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетНаОплату</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Лико_СчетНаОплатуКлиенту</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКомплекта</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтгрузкаВРублях</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Грузополучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Втулка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_Втулки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Намотка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_Намотка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЭтикеткиЗаказчика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерГруппировки</Name>
							<Comment>имеет смысл, когда комплект состоит из позиций с разным количеством (несколько позиций формируют собой "подкомплекты")</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеальныйДоговор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтгрузитьВсе</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧестныйЗнак</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_ЧестныйЗнак</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДляДоступаСлужебная</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Менеджер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БизнесРегионы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗаказа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Лико_ТипыЗаказов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_СостоянияЗаявокНаТранспортировку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_СостоянияЗаявокНаТранспортировку</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ТипыОтгрузкиГотовойПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ТипыОтгрузкиГотовойПродукции</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РеализацияКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеНаСкладРегиона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеНаСкладРегиона2</Name>
					<Comment>В программе делает тоже самое, что и "ПеремещениеНаСкладРегиона"</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеКлиентуИСписаниеСОрганизацииПродавца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеСОрганизацииПроизводителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияКлиентуСПеремещениемНаСкладХранения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеКлиентуСоСкладаХранения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеСоСкладаХранения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеМеждуСкладамиХранения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияКлиентуЧерезСкладРегиона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеНаСкладОтвХраненияДругойПлощадки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеСоСкладаОтвХраненияДругойПлощадки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МногооборотнаяТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/ВариантыИспользованияХарактеристикНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыИспользованияХарактеристикНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеИспользовать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщиеДляВидаНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныеДляНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщиеСДругимВидомНоменклатуры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ЗаявкаНаОтгрузку/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем ЗакрытиеФормы,ОтветилиНаВопросОРазличающихсяЗначениях,ВыбралиПричинуРазличающихсяЦен;

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_Лико_ЗаявкаНаОтгрузку", Неопределено, Объект.Ссылка);
	
	Лико_Дополнительно.ЗаписатьПричинуИзмененияЦены(Объект.Ссылка, ПараметрыЗаписи);
	
КонецПроцедуры  

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) И Объект.СостояниеЗаявки = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт И НЕ (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("Лико_ДоступКИзменениюЗакрытыхЗаявокНаОтгрузку")) Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
		Элементы.ГруппаЗаполнить.Доступность = Ложь;
		Элементы.ГруппаПодстановка.Доступность = Ложь;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ТекущаяДата() >= Дата('20260101') Тогда
			Объект.ДатаОтгрузки = ТекущаяДата() + 86400;
		Иначе
			// До 01.01.26 не будем автоматом заполнять дату отгрукзи, т.к. от нее зависит необходимость пересчета ставки НДС 
			Объект.ДатаОтгрузки = Неопределено;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.Площадка) Тогда
			Объект.Площадка = Лико_Дополнительно.ПлощадкаПользователяПоУмолчанию();
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.ОрганизацияПродавец) Тогда
			Объект.ОрганизацияПродавец = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(,ПараметрыСеанса.ТекущийПользователь,"ОрганизацияПродавец");
		КонецЕсли;
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		Если НЕ ЗначениеЗаполнено(Объект.Склад) Тогда
			Объект.Склад = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, ПараметрыСеанса.ТекущийПользователь, "СкладГотовойПродукции");
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.ТипОтгрузки) Тогда
			Объект.ТипОтгрузки = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, ПараметрыСеанса.ТекущийПользователь, "ТипОтгрузгкиГППоУмолчанию_07e0bde7a56c42168bd4a9bf4b95e0b9");	
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(Объект.ТипЗаявки) И (ВРег(Лев(ОбщегоНазначения.ИмяЗначенияПеречисления(Объект.ТипЗаявки), 7)) = "УДАЛИТЬ") Тогда
		Элементы.ТипЗаявки.СписокВыбора.Добавить(Объект.ТипЗаявки);
	КонецЕсли;
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	Если Объект.ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиентуСПеремещениемНаСкладХранения
		//ИЛИ Объект.ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуСоСкладаХранения
		//ИЛИ Объект.ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСоСкладаХранения
		ИЛИ Объект.ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеМеждуСкладамиХранения
		ИЛИ Объект.ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеНаСкладОтвХраненияДругойПлощадки
		ИЛИ Объект.ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеСоСкладаОтвХраненияДругойПлощадки
		Тогда
		ПоказыватьСкладХранения = Истина;
	Иначе
		ПоказыватьСкладХранения = Ложь;
	КонецЕсли;
	Элементы.СкладХранения.Видимость = ПоказыватьСкладХранения;
	
	Элементы.ОрганизацияПродавец.Видимость = Объект.ДатаОтгрузки >= Дата("20200101");
	//Элементы.Группа7.Видимость = РольДоступна("ПолныеПрава");
	Элементы.Дата.Доступность = РольДоступна("ПолныеПрава");	
		
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ЗаполнитьПоЗаказу(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаОтгрузки) Тогда
		Сообщить("Необходимо заполнить дату отгрузки");
		Возврат;
	КонецЕсли;
	ЗаказКлиента = Неопределено;
	ПоказатьВводЗначения(Новый ОписаниеОповещения("ВводЗаказаКлиентаЗавершение", ЭтотОбъект), ЗаказКлиента, "Выберите заказ клиента", Тип("ДокументСсылка.ЗаказКлиента"));	
	
КонецПроцедуры

&НаКлиенте
Процедура ВводЗаказаКлиентаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ЗаполнитьПоЗаказуНаСервере(Результат);
		ПересчитатьСумму();
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НужноПроверятьЦены(ТипОтгрузки, Партнер)

	Если ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуИСписаниеСОрганизацииПродавца
		ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСОрганизацииПроизводителя
		ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуСоСкладаХранения
		ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСоСкладаХранения
		ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеМеждуСкладамиХранения
		ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеНаСкладОтвХраненияДругойПлощадки
		ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеСоСкладаОтвХраненияДругойПлощадки
	    Тогда
		Возврат Ложь;
	ИначеЕсли ЗначениеЗаполнено(Партнер) 
		И Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Партнер, "Лико_НеПересчитыватьЦеныВСвязиСИзменениемСтавкиНДС", Ложь) Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПоЗаказуНаСервере(ЗаказКлиента)
	
	// Добавим все позиции из заказа клиента. Если такая позиция уже есть, увеличим количество по ней
	ТоварыЗаказа = ЗаказКлиента.Товары.Выгрузить();
	ТоварыЗаказа.Свернуть("Номенклатура,Характеристика,Город,Направление,NКонтракта,Цена,ЦенаДляДокументов,КодЭтикеткиЗаказчика,ЧестныйЗнак,ВнутреннийДиаметр,СтавкаНДС", "Количество");
	ЦенаДляДокументовВключаетНДС = ЗаказКлиента.ЦенаДляДокументовВключаетНДС;
	СтавкаНДС18 = УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС18);
	СтавкаНДС20 = УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС20);
	НомерЗаказа = ЗаказКлиента.НомерБезПрефикса;
	МассивУдаленныхКонтрагентов = Новый Массив;
	Партнер = ЗаказКлиента.Партнер;
			
	Для каждого Строка из ТоварыЗаказа Цикл
		
		//Попробуем найти строку в этом документе
	    Отбор = Новый Структура("ЗаказКлиента,Номенклатура,Характеристика,Город,КодЭтикеткиЗаказчика,ЧестныйЗнак");
		ЗаполнитьЗначенияСвойств(Отбор, Строка);
		Отбор.Вставить("ЗаказКлиента", ЗаказКлиента);
		Отбор.Вставить("Намотка", Строка.Направление);
		Отбор.Вставить("НомерПоставки", Строка.NКонтракта);
		
		СтрокиДокумента = Объект.Товары.НайтиСтроки(Отбор);
		Если СтрокиДокумента.Количество() = 0 Тогда
			НоваяСтрока = Объект.Товары.Добавить();
			НоваяСтрока.ЗаказКлиента = ЗаказКлиента;
			НоваяСтрока.Номенклатура = Строка.Номенклатура;
			НоваяСтрока.Характеристика = Строка.Характеристика;
			НоваяСтрока.Количество = Строка.Количество;
			НоваяСтрока.Примечание = Неопределено;
			НоваяСтрока.Контрагент = ЗаказКлиента.Контрагент;
			НоваяСтрока.НомерПоставки = Строка.NКонтракта;
			Если ЗначениеЗаполнено(Строка.ЦенаДляДокументов) Тогда
				НоваяСтрока.Цена = Строка.ЦенаДляДокументов;
			Иначе
				Если ЦенаДляДокументовВключаетНДС Тогда
					НоваяСтрока.Цена = Строка.Цена;
				Иначе
					ТекПроцентНДС = Строка.СтавкаНДС.Ставка;
					НоваяСтрока.Цена = Строка.Цена * 100 / (100+ТекПроцентНДС);
				КонецЕсли;
			КонецЕсли;
			Если ЦенаДляДокументовВключаетНДС Тогда
				Если Объект.ДатаОтгрузки >= Дата('20190101') И Строка.СтавкаНДС = СтавкаНДС18 И НужноПроверятьЦены(Объект.ТипОтгрузки, Партнер) Тогда
					// Нужно пересчитывать на 20%
					ПересчитатьЦенуПодСтавкуНДС20(НоваяСтрока);
					Если Объект.ДатаОтгрузки >= Дата('20260101') Тогда
						ПересчитатьЦенуПодСтавкуНДС22(НоваяСтрока);
					КонецЕсли;
				КонецЕсли;
				Если Объект.ДатаОтгрузки >= Дата('20260101') И Строка.СтавкаНДС = СтавкаНДС20 И НужноПроверятьЦены(Объект.ТипОтгрузки, Партнер) Тогда
					// Нужно пересчитывать на 22%
					ПересчитатьЦенуПодСтавкуНДС22(НоваяСтрока);
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЗаказКлиента.ВалютаДляДокументов) Тогда
				НоваяСтрока.ВалютаЦены = ЗаказКлиента.ВалютаДляДокументов;
			Иначе
				НоваяСтрока.ВалютаЦены = ЗаказКлиента.Валюта;
			КонецЕсли;
			НоваяСтрока.АдресДоставки = ЗаказКлиента.АдресДоставки;
			НоваяСтрока.АдресДоставкиЗначенияПолей = ЗаказКлиента.АдресДоставкиЗначенияПолей;
			НоваяСтрока.Грузополучатель = ЗаказКлиента.Грузополучатель;
			НоваяСтрока.Втулка = Строка.ВнутреннийДиаметр;
			НоваяСтрока.Намотка = Строка.Направление;
			НоваяСтрока.Город = Строка.Город;
			НоваяСтрока.КодЭтикеткиЗаказчика = Строка.КодЭтикеткиЗаказчика;
			НоваяСтрока.ЧестныйЗнак = Строка.ЧестныйЗнак;
			Если НоваяСтрока.Контрагент.ПометкаУдаления Тогда
				Если МассивУдаленныхКонтрагентов.Найти(НоваяСтрока.Контрагент) = Неопределено Тогда
					Сообщить("Контрагент """ + НоваяСтрока.Контрагент + """ помечен на удаление");
					МассивУдаленныхКонтрагентов.Добавить(НоваяСтрока.Контрагент);
				КонецЕсли;
				НоваяСтрока.Контрагент = Неопределено;
			КонецЕсли;
			Если НоваяСтрока.Грузополучатель.ПометкаУдаления Тогда
				Если МассивУдаленныхКонтрагентов.Найти(НоваяСтрока.Грузополучатель) = Неопределено Тогда
					Сообщить("Грузополучатель """ + НоваяСтрока.Грузополучатель + """ помечен на удаление");
					МассивУдаленныхКонтрагентов.Добавить(НоваяСтрока.Грузополучатель);
				КонецЕсли;
				НоваяСтрока.Грузополучатель = Неопределено;
			КонецЕсли;
		Иначе
			КоличествоДоИзменения = СтрокиДокумента[0].Количество;
			СтрокиДокумента[0].Количество = СтрокиДокумента[0].Количество + Строка.Количество;
			Сообщить("Номенклатура " + Строка.Номенклатура + " \ " + Строка.Характеристика
					+ " добавлена ранее. Номенклатура не добавлена");
			Сообщить(Символы.Таб + " - для номенклатуры " + Строка.Номенклатура + " \ " + Строка.Характеристика
					+ " увеличено количество этикеток с: " + Формат(КоличествоДоИзменения, "ЧГ=0") + " до: " + Формат(СтрокиДокумента[0].Количество, "ЧГ=0"));
		КонецЕсли;
			
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборЗаказов(Команда)
	
	Если Команда.Имя = "ПодборЗаказовПоОстаткамПоНаименованию" Тогда
		ТипПодбора = "ОстаткиПоНоменклатуре";
	ИначеЕсли Команда.Имя = "ПодборЗаказовПоОстаткамПоЗаказу" Тогда
		ТипПодбора = "ОстаткиПоЗаказу";
	ИначеЕсли Команда.Имя = "ПодборПоСпискуЗаказов" Тогда
		ТипПодбора = "ПоСпискуЗаказов";
	Иначе
		Возврат;
	КонецЕсли;
	
	//ПодборСоСкладаХранения = (Объект.ТипОтгрузки = ПредопределенноеЗначение("Перечисление.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуСоСкладаХранения") ИЛИ Объект.ТипОтгрузки = ПредопределенноеЗначение("Перечисление.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСоСкладаХранения"));
	//СкладПодбора = ?(ПодборСоСкладаХранения, Объект.СкладХранения, Объект.Склад);
	Если (ТипПодбора = "ОстаткиПоНоменклатуре" ИЛИ ТипПодбора = "ОстаткиПоЗаказу") И НЕ ЗначениеЗаполнено(Объект.Склад) Тогда
		Сообщить("Необходимо заполнить склад");
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.ДатаОтгрузки) Тогда
		Сообщить("Необходимо заполнить дату отгрузки");
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура("Склад,Дата,ТипПодбора,Документ,Дата,Менеджер,ТипОтгрузки", Объект.Склад, КонецДня(Объект.ДатаОтгрузки), ТипПодбора, Объект.Ссылка, Объект.ДатаОтгрузки, Объект.Ответственный, Объект.ТипОтгрузки);
	ОткрытьФорму("Документ.Лико_ЗаявкаНаОтгрузку.Форма.ФормаПодбора", ПараметрыОткрытия, ЭтаФорма,,,, Новый ОписаниеОповещения("ПодборЗаказовПоОстаткамПоНаименованиюЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборЗаказовПоОстаткамПоНаименованиюЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьСтрокиИзПодбораНаСервере(Результат);
	ПересчитатьСумму();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокиИзПодбораНаСервере(ТаблицаДляПереноса)
	
	МассивУдаленныхКонтрагентов = Новый Массив;
	НужноПроверятьСтавкуНДС18 = Объект.ДатаОтгрузки >= Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаИспользованияСтавкиНДС20.ЗначениеПараметра;
	НужноПроверятьСтавкуНДС20 = Объект.ДатаОтгрузки >= Дата('20260101');
	СтавкаНДС18 = УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС18);
	СтавкаНДС20 = УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС20);
	Для каждого Строка из ТаблицаДляПереноса Цикл
		//Попробуем найти строку в этом документе
	    Отбор = Новый Структура("ЗаказКлиента,Номенклатура,Характеристика,Город,Намотка,НомерПоставки,КодЭтикеткиЗаказчика,ЧестныйЗнак");
		ЗаполнитьЗначенияСвойств(Отбор, Строка);
		
		СтрокиДокумента = Объект.Товары.НайтиСтроки(Отбор);
		Если СтрокиДокумента.Количество() = 0 Тогда
			НоваяСтрока = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			Если НужноПроверятьСтавкуНДС18 И Строка.ЦенаДляДокументовВключаетНДС И Строка.СтавкаНДС = СтавкаНДС18 И НужноПроверятьЦены(Объект.ТипОтгрузки, Строка.Партнер) Тогда
				// Нужно пересчитывать на 20%
				ПересчитатьЦенуПодСтавкуНДС20(НоваяСтрока);
				Если НужноПроверятьСтавкуНДС20 Тогда
					ПересчитатьЦенуПодСтавкуНДС22(НоваяСтрока);
				КонецЕсли;
			КонецЕсли;
			Если НужноПроверятьСтавкуНДС20 И Строка.ЦенаДляДокументовВключаетНДС И Строка.СтавкаНДС = СтавкаНДС20 И НужноПроверятьЦены(Объект.ТипОтгрузки, Строка.Партнер) Тогда
				// Нужно пересчитывать на 22%
				ПересчитатьЦенуПодСтавкуНДС22(НоваяСтрока);
			КонецЕсли;
			Если НоваяСтрока.Контрагент.ПометкаУдаления Тогда
				Если МассивУдаленныхКонтрагентов.Найти(НоваяСтрока.Контрагент) = Неопределено Тогда
					Сообщить("Контрагент """ + НоваяСтрока.Контрагент + """ помечен на удаление");
					МассивУдаленныхКонтрагентов.Добавить(НоваяСтрока.Контрагент);
				КонецЕсли;
				НоваяСтрока.Контрагент = Неопределено;
			КонецЕсли;
			Если НоваяСтрока.Грузополучатель.ПометкаУдаления Тогда
				Если МассивУдаленныхКонтрагентов.Найти(НоваяСтрока.Грузополучатель) = Неопределено Тогда
					Сообщить("Грузополучатель """ + НоваяСтрока.Грузополучатель + """ помечен на удаление");
					МассивУдаленныхКонтрагентов.Добавить(НоваяСтрока.Грузополучатель);
				КонецЕсли;
				НоваяСтрока.Грузополучатель = Неопределено;
			КонецЕсли;
		Иначе
			КоличествоДоИзменения = СтрокиДокумента[0].Количество;
			СтрокиДокумента[0].Количество = СтрокиДокумента[0].Количество + Строка.Количество;
			Сообщить("Номенклатура " + Строка.Номенклатура + " \ " + Строка.Характеристика
					+ " добавлена ранее. Номенклатура не добавлена");
			Сообщить(Символы.Таб + " - для номенклатуры " + Строка.Номенклатура + " \ " + Строка.Характеристика
					+ " увеличено количество этикеток с: " + Формат(КоличествоДоИзменения, "ЧГ=0") + " до: " + Формат(СтрокиДокумента[0].Количество, "ЧГ=0"));
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьЦенуПодСтавкуНДС20(Строка)
	ЦенаСНДС18 = Строка.Цена;
	ЦенаБезНДС = ЦенаСНДС18 / 1.18;
	ЦенаСНДС20 = ЦенаБезНДС * 1.20;
	Строка.Цена = ЦенаСНДС20;
	Сообщить("В заказе " + Строка.ЗаказКлиента.НомерБезПрефикса + " стоит ставка НДС = 18%, поэтому цена для этикетки """ + Строка.Номенклатура + """ была изменена с " + ЦенаСНДС18 + " на " + Строка.Цена);
КонецПроцедуры

&НаСервере
Процедура ПересчитатьЦенуПодСтавкуНДС22(Строка)
	ЦенаСНДС20 = Строка.Цена;
	ЦенаБезНДС = ЦенаСНДС20 / 1.20;
	ЦенаСНДС22 = ЦенаБезНДС * 1.22;
	Строка.Цена = ЦенаСНДС22;
	Сообщить("В заказе " + Строка.ЗаказКлиента.НомерБезПрефикса + " стоит ставка НДС = 20%, поэтому цена для этикетки """ + Строка.Номенклатура + """ была изменена с " + ЦенаСНДС20 + " на " + Строка.Цена);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКолонку(Команда)
	
	ДлинаЛевойЧасти = СтрДлина("ЗаполнитьКолонку");
	ИмяКолонки = Сред(Команда.Имя, ДлинаЛевойЧасти + 1, СтрДлина(Команда.Имя) - ДлинаЛевойЧасти);
	Если Объект.Товары.Количество() = 0 Тогда
		Сообщить("В табличной части нет строк");
		Возврат;
	КонецЕсли;
	Если Элементы.Товары.ТекущиеДанные = Неопределено Тогда
		Элементы.Товары.ТекущаяСтрока = Объект.Товары[0].ПолучитьИдентификатор();
	КонецЕсли;
	ТекущееЗначение = Элементы.Товары.ТекущиеДанные[ИмяКолонки];
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ИмяКолонки", ИмяКолонки);
	ПараметрыОповещения.Вставить("ИдТекущейСтроки", Элементы.Товары.ТекущаяСтрока);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьКолонкуЗавершение", ЭтотОбъект, ПараметрыОповещения);
	ПоказатьВводЗначения(ОписаниеОповещения, ТекущееЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКолонкуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Для каждого Строка из Объект.Товары Цикл
			Строка[ДополнительныеПараметры.ИмяКолонки] = Результат;
		КонецЦикла;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Элементы.Товары.ТекущиеДанные.АдресДоставки) Тогда
		Сообщить("Адрес нужно выбирать из списка адресов");
		Элементы.Товары.ТекущиеДанные.АдресДоставки = "";
		Возврат;			
	КонецЕсли;
	
	ИмяРеквизитаИВладельцаАдресаДоставки = ПолучитьИмяРеквизитаИВладельцаАдресаДоставки(Элемент);
	АдресПредставление = "";
	АдресЗначениеПолей = "";
	Если ИмяРеквизитаИВладельцаАдресаДоставки.ПолныйПутьКСтрокеТЧ Тогда
		Выполнить("АдресПредставление = " + ИмяРеквизитаИВладельцаАдресаДоставки.ИмяРеквизита);
		Выполнить("АдресЗначениеПолей = " + ИмяРеквизитаИВладельцаАдресаДоставки.ИмяРеквизита + "ЗначенияПолей");
		ДоставкаТоваровКлиент.ПриИзмененииПредставленияАдреса(
		    Элемент,
			АдресПредставление,
			АдресЗначениеПолей);
		Выполнить(ИмяРеквизитаИВладельцаАдресаДоставки.ИмяРеквизита + " = АдресПредставление");
		Выполнить(ИмяРеквизитаИВладельцаАдресаДоставки.ИмяРеквизита + "ЗначенияПолей = АдресЗначениеПолей");
	Иначе
		ДоставкаТоваровКлиент.ПриИзмененииПредставленияАдреса(
		    Элемент,
			Объект[ИмяРеквизитаИВладельцаАдресаДоставки.ИмяРеквизита],
			Объект[ИмяРеквизитаИВладельцаАдресаДоставки.ИмяРеквизита + "ЗначенияПолей"]);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИмяРеквизитаИВладельцаАдресаДоставки = ПолучитьИмяРеквизитаИВладельцаАдресаДоставки(Элемент);
	
	Владелец = Неопределено;
	Если ИмяРеквизитаИВладельцаАдресаДоставки.ПолныйПутьКСтрокеТЧ Тогда
		Выполнить("Владелец = " + ИмяРеквизитаИВладельцаАдресаДоставки.ИмяВладельца);
	Иначе
		Владелец = Объект[ИмяРеквизитаИВладельцаАдресаДоставки.ИмяВладельца];
	КонецЕсли;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Объект", Владелец);
	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьАдресЗавершение", ЭтотОбъект, ИмяРеквизитаИВладельцаАдресаДоставки);
	ОткрытьФорму("ОбщаяФорма.Лико_ФормаВыбораАдреса", ПараметрыФормы, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,, ОписаниеОповещения);

	
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиОчистка(Элемент, СтандартнаяОбработка)
	
	АдресДоставкиПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИмяРеквизитаИВладельцаАдресаДоставки(Элемент)
	
	Результат = Новый Структура("ПолныйПутьКСтрокеТЧ,ИмяРеквизита,ИмяВладельца", Ложь, "", "");
	// Получим полный путь к строке ТЧ
	Результат.ПолныйПутьКСтрокеТЧ = Истина;
	ИдСтроки = Элементы.Товары.ТекущаяСтрока;
	ПутьКСтрокеТЧ = "Объект.Товары.НайтиПоИдентификатору(" + ИдСтроки + ").";
	Результат.ИмяРеквизита = ПутьКСтрокеТЧ + "АдресДоставки";
	Если Элементы.Товары.ТекущиеДанные = Неопределено Тогда
		Элементы.Товары.ТекущаяСтрока = Объект.Товары[0].ПолучитьИдентификатор();
	КонецЕсли;
	Если ЗначениеЗаполнено(Элементы.Товары.ТекущиеДанные.Грузополучатель) Тогда
		Результат.ИмяВладельца = ПутьКСтрокеТЧ + "Грузополучатель";
	Иначе
		Результат.ИмяВладельца = ПутьКСтрокеТЧ + "Контрагент";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ИзменитьАдресЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Если ДополнительныеПараметры.ПолныйПутьКСтрокеТЧ Тогда
			Выполнить(ДополнительныеПараметры.ИмяРеквизита + " = Результат.Представление");
			Выполнить(ДополнительныеПараметры.ИмяРеквизита + "ЗначенияПолей = Результат.ЗначенияПолей");
		Иначе
			Объект[ДополнительныеПараметры.ИмяРеквизита] = Результат.Представление;
			Объект[ДополнительныеПараметры.ИмяРеквизита + "ЗначенияПолей"] = Результат.ЗначенияПолей;
		КонецЕсли;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКолонкуАдресДоставки(Команда)
	
	Если Элементы.Товары.ТекущиеДанные = Неопределено Тогда
		Элементы.Товары.ТекущаяСтрока = Объект.Товары[0].ПолучитьИдентификатор();
	КонецЕсли;
	Если ЗначениеЗаполнено(Элементы.Товары.ТекущиеДанные.Грузополучатель) Тогда
		ТекущееЗначение = Элементы.Товары.ТекущиеДанные.Грузополучатель;
	Иначе
		ТекущееЗначение = Элементы.Товары.ТекущиеДанные.Контрагент;
	КонецЕсли;
	ПараметрыОповещения = Новый Структура;
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьАдресДоставкиВыбранКонтрагент", ЭтотОбъект, ПараметрыОповещения);
	ПоказатьВводЗначения(ОписаниеОповещения, ТекущееЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАдресДоставкиВыбранКонтрагент(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Владелец = Результат;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Объект", Владелец);
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьАдресДоставкиЗавершение", ЭтотОбъект);
		ОткрытьФорму("ОбщаяФорма.Лико_ФормаВыбораАдреса", ПараметрыФормы, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,, ОписаниеОповещения);
	КонецЕсли;

КонецПроцедуры
	
&НаКлиенте
Процедура ЗаполнитьАдресДоставкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Для каждого Строка из Объект.Товары Цикл
			Строка.АдресДоставки = Результат.Представление;
			Строка.АдресДоставкиЗначенияПолей = Результат.ЗначенияПолей;
		КонецЦикла;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	ПересчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСумму()
	
	Сумма = 0;
	Для каждого Строка из Объект.Товары Цикл
		Сумма = Сумма + Окр(Строка.Количество * Строка.Цена, 2);
	КонецЦикла;
	
	Для каждого Строка из Объект.Услуги Цикл
		Сумма = Сумма + Окр(Строка.Количество * Строка.Цена, 2);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПересчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзВнешнегоФайла(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ЗагружатьЦены", Истина);
	ПараметрыФормы.Вставить("Лико_ЗагружатьЗаказ", Истина);
	ПараметрыФормы.Вставить("Лико_ЗагружатьКонтрагент", Истина);
	ПараметрыФормы.Вставить("Лико_ЗагружатьНомерПоставки", Истина);
	ПараметрыФормы.Вставить("Лико_ЗагружатьВалюта", Истина);
	ПараметрыФормы.Вставить("Лико_ЗагружатьОтгрузкаВРублях", Истина);
	ПараметрыФормы.Вставить("Лико_ЗагружатьГрузополучатель", Истина);
	ПараметрыФормы.Вставить("Лико_ЗагружатьКодЭтикеткиЗаказчика", Истина);
	ПараметрыФормы.Вставить("Лико_ЗагружатьЧестныйЗнак", Истина);
	ПараметрыФормы.Вставить("Лико_ЗагружатьАдресДоставки", Истина);
	ПараметрыФормы.Вставить("Лико_ЗагружатьПримечание", Истина);
	ПараметрыФормы.Вставить("Лико_ЗагружатьНамотка", Истина);
	ПараметрыФормы.Вставить("Лико_ЗагружатьГород", Истина);
	ПараметрыФормы.Вставить("Лико_ЗагружатьВтулка", Истина);
	ПараметрыФормы.Вставить("Лико_ЗагружатьНомерКомплекта", Истина);
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар"));
	МассивТиповНоменклатуры = Новый ФиксированныйМассив(МассивТипов);
	ПараметрыФормы.Вставить("ОтборПоТипуНоменклатуры", МассивТиповНоменклатуры);
	ПараметрыФормы.Вставить("Лико_СкладДляПодбораПоОстаткам", Объект.Склад);
	
	ПараметрыКоманды = Лико_Дополнительно.ПолучитьПараметрыКомандыВнешнейОбработки("ВнешняяОбработкаЗагрузкаДанныхИзВнешнихФайлов");
	Если ЗначениеЗаполнено(ПараметрыКоманды) Тогда
		ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(ПараметрыКоманды.Ссылка);
		Если ПараметрыКоманды.ЭтоОтчет Тогда
			ОткрытьФорму("ВнешнийОтчет." + ИмяОбработки + ".Форма", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
		Иначе
			ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "ВнешняяОбработка.ЗагрузкаДанныхИзВнешнихФайлов.Форма.Форма" Тогда
		ПолучитьЗагруженныеТоварыИзХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);
		ПересчитатьСумму();
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПолучитьЗагруженныеТоварыИзХранилища(АдресТоваровВХранилище)
	
	ТоварыИзХранилища = ПолучитьИзВременногоХранилища(АдресТоваровВХранилище);
	
	Для каждого Строка из ТоварыИзХранилища Цикл
		НоваяСтрока = Объект.Товары.Добавить();
		НоваяСтрока.ЗаказКлиента = Строка.Лико_Заказ;
		НоваяСтрока.Номенклатура = Строка.Номенклатура;
		НоваяСтрока.Характеристика = Лико_Дополнительно.ПолучитьХарактеристикуПоЗаказуИНоменклатуре(НоваяСтрока.Номенклатура, НоваяСтрока.ЗаказКлиента);
		НоваяСтрока.Количество = Строка.Количество;
		НоваяСтрока.Примечание = Строка.Лико_Примечание;
		НоваяСтрока.Контрагент = Строка.Лико_Контрагент;
		НоваяСтрока.НомерПоставки = Строка.Лико_НомерПоставки;
		НоваяСтрока.Цена = Строка.Цена;
		НоваяСтрока.ВалютаЦены = Строка.Лико_Валюта;
		НоваяСтрока.АдресДоставки = Строка.Лико_АдресДоставки;
		НоваяСтрока.ОтгрузкаВРублях = Строка.Лико_ОтгрузкаВРублях;
		НоваяСтрока.Грузополучатель = Строка.Лико_Грузополучатель;
		НоваяСтрока.Втулка = Строка.Лико_Втулка;
		НоваяСтрока.Намотка = Строка.Лико_Намотка;
		НоваяСтрока.Город = Строка.Лико_Город;
		НоваяСтрока.КодЭтикеткиЗаказчика = Строка.Лико_КодЭтикеткиЗаказчика;		
		НоваяСтрока.ЧестныйЗнак = Строка.Лико_ЧестныйЗнак;		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДопДанныеИзЗаказа(Команда)
	
	ОткрытьФорму("Документ.Лико_ЗаявкаНаТранспортировку.Форма.ФормаВыбораКлючевыхПараметров", Новый Структура("ВариантОткрытия", "ЗаявкаНаОтгрузку"),,,,, Новый ОписаниеОповещения("ВыбраныДопДанныеДляЗаполненияИзЗаказа", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	//ПоказатьВопрос(Новый ОписаниеОповещения("ОтветНаВопросОПерезаполненииЦен", ЭтотОбъект), "Перезаполнить цены данными из заказов?", РежимДиалогаВопрос.ДаНетОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбраныДопДанныеДляЗаполненияИзЗаказа(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ (Результат.Цена ИЛИ Результат.Город ИЛИ Результат.КодЭтикеткиЗаказчика ИЛИ Результат.ЧестныйЗнак ИЛИ Результат.Намотка ИЛИ Результат.НомерПоставки ИЛИ Результат.Втулка) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДопДанныеИзЗаказаНаСервере(Результат);
	Сообщить("Доп. данные перезаполнены из заказов");
	Модифицированность = Истина;
	ПересчитатьСумму();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДопДанныеИзЗаказаНаСервере(ДопДанные)
	
	Для каждого Строка из Объект.Товары Цикл
		// Найдем номенклатуру в заказе
		Если НЕ ЗначениеЗаполнено(Строка.ЗаказКлиента) ИЛИ НЕ ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			Сообщить("В строке № " + Строка.НомерСтроки + " не заполнен заказ или номенклатура. Строка пропущена");
			Продолжить;
		КонецЕсли;
		НайденнаяСтрока = Строка.ЗаказКлиента.Товары.Найти(Строка.Номенклатура, "Номенклатура");
		Если НайденнаяСтрока = Неопределено Тогда
			Сообщить("Строка № " + Строка.НомерСтроки + " не найдена в заказе. Строка пропущена");
			Продолжить;
		КонецЕсли;
		Если ДопДанные.Цена Тогда
			Строка.ВалютаЦены = Строка.ЗаказКлиента.ВалютаДляДокументов;
			Если НЕ ЗначениеЗаполнено(Строка.ВалютаЦены) Тогда
				Сообщить("Для строки № " + Строка.НомерСтроки + " в заказе не заполнено поле ""Валюта для документов""");
			КонецЕсли;
			Строка.Цена = НайденнаяСтрока.ЦенаДляДокументов; 
			Если НЕ ЗначениеЗаполнено(Строка.Цена) Тогда
				Строка.Цена = НайденнаяСтрока.Цена; 
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Строка.Цена) Тогда
				Сообщить("Для строки № " + Строка.НомерСтроки + " в заказе не заполнены поля ""Цена"" и ""Цена для документов""");
			КонецЕсли;
		КонецЕсли;
		Если ДопДанные.Город Тогда
			Строка.Город = НайденнаяСтрока.Город; 
		КонецЕсли;
		Если ДопДанные.КодЭтикеткиЗаказчика Тогда
			Строка.КодЭтикеткиЗаказчика = НайденнаяСтрока.КодЭтикеткиЗаказчика; 
		КонецЕсли;
		Если ДопДанные.ЧестныйЗнак Тогда
			Строка.ЧестныйЗнак = НайденнаяСтрока.ЧестныйЗнак; 
		КонецЕсли;
		Если ДопДанные.Намотка Тогда
			Строка.Намотка = НайденнаяСтрока.Направление; 
		КонецЕсли;
		Если ДопДанные.НомерПоставки Тогда
			Строка.НомерПоставки = НайденнаяСтрока.NКонтракта; 
		КонецЕсли;
		Если ДопДанные.Втулка Тогда
			Строка.Втулка = НайденнаяСтрока.ВнутреннийДиаметр; 
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКолонкуРеальныйДоговор(Команда)
	
	Если Объект.Товары.Количество() = 0 Тогда
		Сообщить("В табличной части нет строк");
		Возврат;
	КонецЕсли;
	Если Элементы.Товары.ТекущиеДанные = Неопределено Тогда
		Элементы.Товары.ТекущаяСтрока = Объект.Товары[0].ПолучитьИдентификатор();
	КонецЕсли;
	ТекущееЗначение = Элементы.Товары.ТекущиеДанные.РеальныйДоговор;
	ТекущийКонтрагент = Элементы.Товары.ТекущиеДанные.Контрагент;
	Если НЕ ЗначениеЗаполнено(ТекущийКонтрагент) Тогда
		Сообщить("В выбранной строке не заполнен контрагент");
		Возврат;
	КонецЕсли;
	ОписаниеОповещения = Новый ОписаниеОповещения("Лико_ВыбранРеальныйДоговор", ЭтотОбъект);
	
	фиксНастройки = Новый НастройкиКомпоновкиДанных;
	
	эОтбор = фиксНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	эОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Контрагент");
	эОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	эОтбор.ПравоеЗначение = ТекущийКонтрагент;
	эОтбор.Использование = Истина;
	
	эОтбор = фиксНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	эОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Лико_ЭтоРеальныйДоговор");
	эОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	эОтбор.ПравоеЗначение = Истина;
	эОтбор.Использование = Истина;
	
	ПараметрыОтбора = Новый Структура;    
	ПараметрыОтбора.Вставить("ФиксированныеНастройки", фиксНастройки);
	
	ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора", ПараметрыОтбора,,,,, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура Лико_ВыбранРеальныйДоговор(Результат, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Для каждого Строка из Объект.Товары Цикл
			Строка.РеальныйДоговор = Результат;
		КонецЦикла;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКоличествоИзОстатков(Команда)
	
	Если Объект.Товары.Количество() = 0 Тогда
		Сообщить("В табличной части нет строк");
		Возврат;
	КонецЕсли;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ОтветНаВопросОПерезаполненииКоличестваИзОстатков", ЭтотОбъект), "Будет перезаполнено количество по всем строкам количеством из остатков." + Символы.ПС + "Продолжить?", РежимДиалогаВопрос.ДаНетОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветНаВопросОПерезаполненииКоличестваИзОстатков(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполнитьКоличествоИзОстатковНаСервере();
		Сообщить("Количество перезаполнено");
		Модифицированность = Истина;
		ПересчитатьСумму();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКоличествоИзОстатковНаСервере()
	
	МассивЗаказов = Новый Массив;
	Для каждого Строка из Объект.Товары Цикл
		Если ЗначениеЗаполнено(Строка.ЗаказКлиента) И МассивЗаказов.Найти(Строка.ЗаказКлиента) = Неопределено Тогда
			МассивЗаказов.Добавить(Строка.ЗаказКлиента);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = Документы.Лико_ЗаявкаНаОтгрузку.ПолучитьТекстЗапросаДляДереваОстатки(, Объект.Склад.ИспользоватьАдресноеХранение);
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	Запрос.УстановитьПараметр("ЯчейкаРастарка", Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Объект.Склад, "ЯчейкаРастарка"));
	Запрос.УстановитьПараметр("ОтборПоЗаказам", Истина);
	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	Запрос.УстановитьПараметр("Партнер", Неопределено);
	Запрос.УстановитьПараметр("Менеджер", Неопределено);
	ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
	
	Отбор = Новый Структура("ЗаказКлиента,Номенклатура,Характеристика,НомерПоставки,Намотка,Город,КодЭтикеткиЗаказчика,ЧестныйЗнак");
	Для каждого Строка из Объект.Товары Цикл
		Строка.Количество = 0;
		ЗаполнитьЗначенияСвойств(Отбор, Строка);
		ОстаткиПоСтроке = ТаблицаОстатков.НайтиСтроки(Отбор);
		Если ОстаткиПоСтроке.Количество() > 0 Тогда
			Строка.Количество = ОстаткиПоСтроке[0].Количество;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ТипОтгрузкиПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
	Если НЕ Элементы.СкладХранения.Видимость И ЗначениеЗаполнено(Объект.СкладХранения) Тогда
		Объект.СкладХранения = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(Объект.ТипОтгрузки) Тогда
		Отказ = Истина;
		Сообщить("Необходимо заполнить тип отгрузки");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаОтгрузки) Тогда
		Отказ = Истина;
		Сообщить("Необходимо заполнить дату отгрузки");
		Возврат;
	КонецЕсли;
	
	Если Объект.ДатаОтгрузки < Дата("20200101") И ЗначениеЗаполнено(Объект.ОрганизацияПродавец) Тогда
		Объект.ОрганизацияПродавец = Неопределено;
	КонецЕсли;
	
	Если ЗакрытиеФормы Тогда
		ОтключитьОбработчикОжидания("ОбработчикОжиданияСброситьПризнакЗакрытияФормы");
	КонецЕсли;
	
	Если ОтветилиНаВопросОРазличающихсяЗначениях И ВыбралиПричинуРазличающихсяЦен Тогда
		ОтветилиНаВопросОРазличающихсяЗначениях = Ложь;
		ВыбралиПричинуРазличающихсяЦен = Ложь;
		//Если ЗакрытиеФормы Тогда
		//	ЗакрытиеФормы = Ложь;
		//	ПодключитьОбработчикОжидания("ЗакрытьФормуОбрабочиком", 0.1, Истина);
		//КонецЕсли;
	Иначе
		Если НЕ ОтветилиНаВопросОРазличающихсяЗначениях Тогда
			Результат = ПроверитьПовторяющиесяЗначенияВКолонках();
			Если ЗначениеЗаполнено(Результат) Тогда
				// Зададим вопрос
				Отказ = Истина;
				ОписаниеОповещения = Новый ОписаниеОповещения("ОтветНаВопросОПовторяющихсяЗначенияхВКолонках", ЭтотОбъект, ПараметрыЗаписи);
				ПоказатьВопрос(ОписаниеОповещения, Результат, РежимДиалогаВопрос.ДаНетОтмена);
				Возврат;
			КонецЕсли;
		КонецЕсли;
		Если НЕ ВыбралиПричинуРазличающихсяЦен И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			РезультатПроверки = ПроверитьТаблицуЦенНаСоответствиеЦенамЗаказа();
			Если ЗначениеЗаполнено(РезультатПроверки) И РезультатПроверки.Свойство("Сообщение") И ЗначениеЗаполнено(РезультатПроверки.Сообщение) Тогда
				// Попросим выбрать причину
				Отказ = Истина;
				ПараметрыЗаписи.Вставить("РезультатПроверки", РезультатПроверки);
				ОписаниеОповещения = Новый ОписаниеОповещения("ВыбралиПричинуРазличающихсяЦен", ЭтотОбъект, ПараметрыЗаписи);
				ОткрытьФорму("Справочник.Лико_ПричиныИзмененияЦенПродажи.ФормаВыбора", Новый Структура("Заголовок", РезультатПроверки.Сообщение), ЭтаФорма, Истина,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				Возврат;
			ИначеЕсли ЗначениеЗаполнено(РезультатПроверки) И РезультатПроверки.Свойство("НеУдалятьПредыдущуюПричину") Тогда
				ПараметрыЗаписи.Вставить("НеУдалятьПредыдущуюПричину");				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Раз дошло до этого места, значит задавать вопрос и выбирать причину не нужно (либо уже спросили/выбрали)
	ОтветилиНаВопросОРазличающихсяЗначениях = Ложь;	
	ВыбралиПричинуРазличающихсяЦен = Ложь;
	
	Если ЗакрытиеФормы Тогда
		ЗакрытиеФормы = Ложь;
		ПодключитьОбработчикОжидания("ЗакрытьФормуОбрабочиком", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьТаблицуЦенНаСоответствиеЦенамЗаказа();
	
	УстановитьПривилегированныйРежим(Истина);
	Если НЕ ЗначениеЗаполнено(Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаПроверкиЦенПродажи.ЗначениеПараметра) ИЛИ Объект.ДатаОтгрузки < Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаПроверкиЦенПродажи.ЗначениеПараметра Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если 
		//Объект.ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуИСписаниеСОрганизацииПродавца // Реализацию без денег все таки будем проверять
		//ИЛИ 
		Объект.ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуСоСкладаХранения
		ИЛИ Объект.ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСоСкладаХранения 		
		ИЛИ Объект.ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСОрганизацииПроизводителя
		ИЛИ Объект.ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеМеждуСкладамиХранения
		Тогда
		// Это не продажа, спрашивать не нужно
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаДляПроверки = Объект.Товары.Выгрузить(, "ЗаказКлиента,Номенклатура,Характеристика,Количество,ВалютаЦены,Цена");
	ТаблицаДляПроверки.Колонки.ВалютаЦены.Имя = "Валюта";
	РезультатПроверки = Лико_Дополнительно.ПроверитьТаблицуЦенНаСоответствиеЦенамЗаказа(ТаблицаДляПроверки, Объект.ДатаОтгрузки, Объект.ТипОтгрузки);
	Если НЕ ЗначениеЗаполнено(РезультатПроверки.Сообщение) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) ИЛИ НЕ Объект.Ссылка.Проведен Тогда
		// Это новый документ или документ был распроведен, спросим причину
		Возврат РезультатПроверки;
	КонецЕсли;
	
	Если Объект.Ссылка.ТипОтгрузки <> Объект.ТипОтгрузки Тогда
		// Поменяли тип отгрузки, спросим причину
		Возврат РезультатПроверки;
	КонецЕсли;
	
	// Проверим, менялась ли таблица с предыдущей записи
	ТаблицаВСсылке = Объект.Ссылка.Товары.Выгрузить(, "Характеристика,Количество,ВалютаЦены,Цена");
	ТаблицаВОбъекте = Объект.Товары.Выгрузить(, "Характеристика,Количество,ВалютаЦены,Цена");
	ТаблицыРазличаются = Лико_Дополнительно.СравнениеДвухОдинаковыхТаблицЗначенийПоСодержимому(ТаблицаВСсылке, ТаблицаВОбъекте);
	Если ТаблицыРазличаются Тогда
		// Нужно спрашивать причину
		Возврат РезультатПроверки;
	КонецЕсли;
	
	// Если в таблице есть рублевые строки, то нужно также проверить дату отгрузки
	Если Объект.ДатаОтгрузки <> Объект.Ссылка.ДатаОтгрузки Тогда
		Возврат РезультатПроверки;
		//НайденныеРублевыеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("ВалютаЦены", Константы.ВалютаРегламентированногоУчета.Получить()));
		//Если НайденныеРублевыеСтроки.Количество() > 0 Тогда
		//	// Есть рублевые строки
		//	// Проверим, спрашивали ли уже причину. Если спрашивали, то второй раз при изменении даты отгрузки спрашивать не будем
		//	Запрос = Новый Запрос;
		//	Запрос.Текст = 
		//		"ВЫБРАТЬ
		//		|	Лико_ИсторияДляРассылкиОтчетовПоИзменениюДанных.Период КАК Период
		//		|ИЗ
		//		|	РегистрСведений.Лико_ИсторияДляРассылкиОтчетовПоИзменениюДанных КАК Лико_ИсторияДляРассылкиОтчетовПоИзменениюДанных
		//		|ГДЕ
		//		|	(ВЫРАЗИТЬ(Лико_ИсторияДляРассылкиОтчетовПоИзменениюДанных.ДопДанные1 КАК Документ.Лико_ЗаявкаНаОтгрузку)) = &Ссылка
		//		|	И Лико_ИсторияДляРассылкиОтчетовПоИзменениюДанных.ТипДанных = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыДанныхРегистраИсторииДляРассылкиОтчетов.УменьшениеЦеныПродажи)";
		//	
		//	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		//	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		//	Если ВыборкаДетальныеЗаписи.Следующий() И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Период) Тогда
		//		// Уже спрашивали
		//	Иначе
		//		Возврат РезультатПроверки;
		//	КонецЕсли;
		//КонецЕсли;
	КонецЕсли;
	
	// Сообщение есть, но спрашивать причину не нужно
	Возврат Новый Структура("НеУдалятьПредыдущуюПричину");
	
КонецФункции

&НаКлиенте
Процедура ОтветНаВопросОПовторяющихсяЗначенияхВКолонках(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОтветилиНаВопросОРазличающихсяЗначениях = Истина;
		Записать(ДопПараметры);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВыбралиПричинуРазличающихсяЦен(Причина, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Причина) Тогда
		// Нужно запросить комментарий
		ДопПараметры.Вставить("Причина", Причина);
		ДопПараметры.Вставить("ПричинаПрочее", Причина = ПредопределенноеЗначение("Справочник.Лико_ПричиныИзмененияЦенПродажи.Прочее"));
		ОписаниеОповещения = Новый ОписаниеОповещения("ВвелиКомментарийОбИзмененииЦен", ЭтотОбъект, ДопПараметры);
		ПоказатьВводСтроки(ОписаниеОповещения,, ?(ДопПараметры.ПричинаПрочее, "Обязательно", "При необходимости") + " введите комментарий", 1000, Ложь);
	Иначе
		Сообщить("Не выбрана причина изменения цен. Проведение невозможно");
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВвелиКомментарийОбИзмененииЦен(Комментарий, ДопПараметры) Экспорт
	
	Если ДопПараметры.ПричинаПрочее И НЕ ЗначениеЗаполнено(Комментарий) Тогда
		Сообщить("Выбрана причина ""Прочее"" и не введен комментарий. Проведение невозможно");
		Возврат;
	КонецЕсли;

	ДопПараметры.Вставить("Комментарий", ?(НЕ ЗначениеЗаполнено(Комментарий), "", СокрЛП(Комментарий)));
	ВыбралиПричинуРазличающихсяЦен = Истина;
	Записать(ДопПараметры);
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ЗакрытиеФормы = Истина;
	ПодключитьОбработчикОжидания("ОбработчикОжиданияСброситьПризнакЗакрытияФормы", 1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияСброситьПризнакЗакрытияФормы()
	
	Если НЕ ЗакрытиеФормы Тогда
		ОтключитьОбработчикОжидания("ОбработчикОжиданияСброситьПризнакЗакрытияФормы");
		Возврат;
	КонецЕсли;
	
	Если ВводДоступен() Тогда
		ЗакрытиеФормы = Ложь;
	Иначе
		// Скорее всего еще открыто окно вопроса о необходимости сохранять форму
		ПодключитьОбработчикОжидания("ОбработчикОжиданияСброситьПризнакЗакрытияФормы", 1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьПовторяющиесяЗначенияВКолонках()
	
	ИменаКолонок = "";
	КоличествоКолонок = 0;
	Если ЕстьПовторыВКолонке("ВалютаЦены") Тогда
		ИменаКолонок = ИменаКолонок + ?(ЗначениеЗаполнено(ИменаКолонок), ", """, """") + "Валюта" + """";
		КоличествоКолонок = КоличествоКолонок + 1;
	КонецЕсли;
	Если ЕстьПовторыВКолонке("Контрагент") Тогда
		ИменаКолонок = ИменаКолонок + ?(ЗначениеЗаполнено(ИменаКолонок), ", """, """") + "Контрагент" + """";
		КоличествоКолонок = КоличествоКолонок + 1;
	КонецЕсли;
	Если ЕстьПовторыВКолонке("ОтгрузкаВРублях") Тогда
		ИменаКолонок = ИменаКолонок + ?(ЗначениеЗаполнено(ИменаКолонок), ", """, """") + "Отгрузка в рублях" + """";
		КоличествоКолонок = КоличествоКолонок + 1;
	КонецЕсли;
	Если ЕстьПовторыВКолонке("Грузополучатель") Тогда
		ИменаКолонок = ИменаКолонок + ?(ЗначениеЗаполнено(ИменаКолонок), ", """, """") + "Грузополучатель" + """";
		КоличествоКолонок = КоличествоКолонок + 1;
	КонецЕсли;
	Если ЕстьПовторыВКолонке("РеальныйДоговор") Тогда
		ИменаКолонок = ИменаКолонок + ?(ЗначениеЗаполнено(ИменаКолонок), ", """, """") + "Реальный договор" + """";
		КоличествоКолонок = КоличествоКолонок + 1;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИменаКолонок) Тогда
		Возврат ?(КоличествоКолонок = 1, "В колонке ", "В колонках ") + ИменаКолонок + " содержатся разные значения. Вы уверены, что хотите сохранить?";
	Иначе
		Возврат "";
	КонецЕсли;
		
КонецФункции

&НаСервере
Функция ЕстьПовторыВКолонке(ИмяКолонки)
	
	МассивЗначений = Новый Массив;
	Для каждого Строка из Объект.Товары Цикл
		Если МассивЗначений.Найти(Строка[ИмяКолонки]) = Неопределено Тогда
			МассивЗначений.Добавить(Строка[ИмяКолонки]);
		КонецЕсли;
	КонецЦикла;
	Если МассивЗначений.Количество() > 1 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЗакрытьФормуОбрабочиком()
	
	Если НЕ Модифицированность Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОтгрузкиПриИзменении(Элемент)
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСчетуНаПредоплату(Команда)
	
	ТекущееЗначение = ПредопределенноеЗначение("Документ.Лико_СчетНаОплатуКлиенту.ПустаяСсылка");
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоСчетуНаПредоплатуЗавершение", ЭтотОбъект);
	ПоказатьВводЗначения(ОписаниеОповещения, ТекущееЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСчетуНаПредоплатуЗавершение(Результат, ДопПараметры) Экспорт // --> Начало Лико Ефимов ЕВВ 30.12.2019
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоСчетуНаПредоплатуНаСервере(Результат);
	Модифицированность = Истина;
	ПересчитатьСумму();
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 30.12.2019

&НаСервере
Процедура ЗаполнитьПоСчетуНаПредоплатуНаСервере(СчетНаПредоплату)
	
	Объект.ОрганизацияПродавец = СчетНаПредоплату.Организация;
	Для каждого Строка из СчетНаПредоплату.Товары Цикл
		Если Строка.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
			НоваяСтрока = Объект.Услуги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, "Номенклатура,Характеристика,Количество,Цена,Содержание");
		Иначе
			НоваяСтрока = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, "Номенклатура,Характеристика,Количество,Цена");
			НоваяСтрока.ЗаказКлиента = НоваяСтрока.Характеристика.Лико_ЗаказНоменклатуры;
			НоваяСтрока.Контрагент = СчетНаПредоплату.Контрагент;
			НоваяСтрока.ВалютаЦены = СчетНаПредоплату.Валюта;
			НоваяСтрока.СчетНаОплату = СчетНаПредоплату;
		КонецЕсли;
	КонецЦикла;
	
	СтруктураДопДанных = Новый Структура();
	СтруктураДопДанных.Вставить("Цена", Ложь);
	СтруктураДопДанных.Вставить("Город", Истина);
	СтруктураДопДанных.Вставить("КодЭтикеткиЗаказчика", Истина);
	СтруктураДопДанных.Вставить("ЧестныйЗнак", Истина);
	СтруктураДопДанных.Вставить("Намотка", Истина);
	СтруктураДопДанных.Вставить("НомерПоставки", Истина);
	СтруктураДопДанных.Вставить("Втулка", Истина);
	ЗаполнитьДопДанныеИзЗаказаНаСервере(СтруктураДопДанных);
	Сообщить("Данные заявки заполнены по документу """ + СчетНаПредоплату + """");
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиХарактеристикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИдСтроки = Элементы.Услуги.ТекущаяСтрока;
	Если ПроверитьНеобходимостьВводаХарактеристикиДляУслуги(ИдСтроки, СтандартнаяОбработка) Тогда
		ДопПараметры = Новый Структура("ИдСтроки", ИдСтроки);
		ОткрытьФорму("Документ.ЗаказКлиента.ФормаВыбора",,,,,,Новый ОписаниеОповещения("ВыбранЗаказДляХарактеристикиУслуги", ЭтотОбъект, ДопПараметры));
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПроверитьНеобходимостьВводаХарактеристикиДляУслуги(ИдСтроки, СтандартнаяОбработка)
	
	ТекСтрока = Объект.Услуги.НайтиПоИдентификатору(ИдСтроки);
	Если НЕ ЗначениеЗаполнено(ТекСтрока.Номенклатура) Тогда
		Сообщить("Сначала выберите номенклатуру");
		СтандартнаяОбработка = Ложь;
		Возврат Ложь;
	КонецЕсли;
	
	Если ТекСтрока.Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Услуга Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТекСтрока.Номенклатура.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать Тогда
		Сообщить("Для выбранной номенклатуры отключено использование характеристик");
		СтандартнаяОбработка = Ложь;
		Возврат Ложь;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ВыбранЗаказДляХарактеристикиУслуги(Результат, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Модифицированность = Истина;
		ДопПараметры.Вставить("Заказ", Результат);
		ДобавитьХарактеристикуПоЗаказу(ДопПараметры);		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьХарактеристикуПоЗаказу(ДопПараметры)
	
	ТекСтрока = Объект.Услуги.НайтиПоИдентификатору(ДопПараметры.ИдСтроки);
	ТекСтрока.Характеристика = Документы.Лико_ЗаявкаНаОтгрузку.НайтиИлиСоздатьХарактеристикуДляУслуги(ТекСтрока.Номенклатура, ДопПараметры.Заказ);
	
КонецПроцедуры

&НаСервере
Процедура ТоварыНоменклатураПриИзмененииНаСервере(ИдСтроки)
	
	ТекущаяСтрока = Объект.Товары.НайтиПоИдентификатору(ИдСтроки);
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущаяСтрока.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
		Сообщить("Услуги следует вводить в табличной части ""Услуги""");
		ТекущаяСтрока.Номенклатура = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	ТоварыНоменклатураПриИзмененииНаСервере(Элементы.Товары.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	ПересчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	Если Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда
		ЗакрытиеФормы = Истина;
	Иначе
		ЗакрытиеФормы = Ложь;
	КонецЕсли;
	Если ЗакрытиеФормы Тогда
		ЗакрытиеФормы = Ложь;
		ПодключитьОбработчикОжидания("ЗакрытьФормуОбрабочиком", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если Объект.СостояниеЗаявки = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Подтвержден И ТекущийОбъект.ДополнительныеСвойства.СостояниеЗаявкиВСсылке <> Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Подтвержден Тогда
		АдресДляОповещенияОПодтвержденииЗаявки = Лико_Дополнительно.НайтиЭлектронныйАдресОтветственногоПоСкладу(Объект.Склад, "ЛкАдресДляОтправкиПисемОПодтвержденииЗаявкиНаОтгрузку",, Ложь);
		Если ЗначениеЗаполнено(АдресДляОповещенияОПодтвержденииЗаявки) Тогда
			Тема = "Оформлена заявка на отгрузку " + Объект.Номер + " по складу """ + Объект.Склад + """";
			
			ИмяФайла = ПолучитьИмяВременногоФайла();
			ВнОбработка = Лико_Дополнительно.НайтиДополнительнуюОбработкуПоИмениОбъекта("ЗаявкаНаОтгрузкуЕРП");
			Если НЕ ЗначениеЗаполнено(ВнОбработка) Тогда
				Сообщить("В справочнике предопределенных значений не найдена печатная форма ""Заявка на отгрузку""");
				Возврат;
			КонецЕсли;
			ДвоичныеДанные = ВнОбработка.ХранилищеОбработки.Получить();
			ДвоичныеДанные.Записать(ИмяФайла);
			ВнешняяОбработка = ВнешниеОбработки.Создать(ИмяФайла, Ложь);
			
			МассивОбъектов = Новый Массив;
			МассивОбъектов.Добавить(Объект.Ссылка);
			ТабДоки = ВнешняяОбработка.ПечатьВнешнейПечатнойФормы(МассивОбъектов);
			Попытка
				УдалитьФайлы(ИмяФайла);
			Исключение
			КонецПопытки;
			
			ИмяФайла = Неопределено;
			
			Если ТабДоки <> Неопределено И ТабДоки.Количество() > 0 Тогда
				ИмяФайла = КаталогВременныхФайлов() + "Заявка на отгрузку " + Объект.Номер + ".xlsx";
				ТабДоки[0].ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
			КонецЕсли;
			
			Текст = Тема;
			Если Объект.Товары.Количество() > 0 Тогда
				Текст = Текст + ". Контрагент """ + Объект.Товары[0].Контрагент + """";
			КонецЕсли;
				
			Лико_Планирование.ОтправитьПисьмо(Текст, Тема, АдресДляОповещенияОПодтвержденииЗаявки,,,,, ИмяФайла, Ложь);
			
			Если ЗначениеЗаполнено(ИмяФайла) Тогда 
				Попытка
					УдалитьФайлы(ИмяФайла);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьШаблонЗаявкиНаОтгрузкуНаСервере()

	Результат = Новый Структура("Ссылка,Сообщение", Неопределено, "");
	
	Если Объект.Товары.Количество() = 0 Тогда
		Результат.Сообщение = "Необходимо заполнить таблицу товаров";
		Возврат Результат;
	КонецЕсли;
	
	ПерваяСтрока = Объект.Товары[0];     
	
	// Проверим, есть ли уже шаблон с такими ключевыми параметрами
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ШаблоныЗаявокНаОтгрузку.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Лико_ШаблоныЗаявокНаОтгрузку КАК Лико_ШаблоныЗаявокНаОтгрузку
		|ГДЕ
		|	НЕ Лико_ШаблоныЗаявокНаОтгрузку.ПометкаУдаления
		|	И Лико_ШаблоныЗаявокНаОтгрузку.Партнер = &Партнер
		|	И Лико_ШаблоныЗаявокНаОтгрузку.Контрагент = &Контрагент
		|	И Лико_ШаблоныЗаявокНаОтгрузку.ТипЗаявки = &ТипЗаявки
		|	И Лико_ШаблоныЗаявокНаОтгрузку.Склад = &Склад
		|	И Лико_ШаблоныЗаявокНаОтгрузку.Город = &Город
		|	И Лико_ШаблоныЗаявокНаОтгрузку.ТипОтгрузки = &ТипОтгрузки
		|	И Лико_ШаблоныЗаявокНаОтгрузку.ОрганизацияПродавец = &ОрганизацияПродавец
		|	И (ВЫРАЗИТЬ(Лико_ШаблоныЗаявокНаОтгрузку.АдресДоставки КАК СТРОКА(1000))) = &АдресДоставки
		|	И Лико_ШаблоныЗаявокНаОтгрузку.ОтгрузкаВРублях = &ОтгрузкаВРублях
		|	И Лико_ШаблоныЗаявокНаОтгрузку.Грузополучатель = &Грузополучатель
		|	И Лико_ШаблоныЗаявокНаОтгрузку.ВалютаЦены = &ВалютаЦены
		|	И Лико_ШаблоныЗаявокНаОтгрузку.Площадка = &Площадка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка";
	
	Запрос.УстановитьПараметр("АдресДоставки", ПерваяСтрока.АдресДоставки);
	Запрос.УстановитьПараметр("ВалютаЦены", ПерваяСтрока.ВалютаЦены);
	Запрос.УстановитьПараметр("Город", ПерваяСтрока.Город);
	Запрос.УстановитьПараметр("Грузополучатель", ПерваяСтрока.Грузополучатель);
	Запрос.УстановитьПараметр("Контрагент", ПерваяСтрока.Контрагент);
	Запрос.УстановитьПараметр("ОрганизацияПродавец", Объект.ОрганизацияПродавец);
	Запрос.УстановитьПараметр("ОтгрузкаВРублях", ПерваяСтрока.ОтгрузкаВРублях);
	Запрос.УстановитьПараметр("Партнер", ПерваяСтрока.Контрагент.Партнер);
	Запрос.УстановитьПараметр("Площадка", Объект.Площадка);
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	Запрос.УстановитьПараметр("ТипЗаявки", Объект.ТипЗаявки);
	Запрос.УстановитьПараметр("ТипОтгрузки", Объект.ТипОтгрузки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат.Сообщение = "Открыта форма уже существующего шаблона с такими же ключевыми параметрами";
		Результат.Ссылка = Выборка.Ссылка;
		Возврат Результат;
	КонецЕсли;

	МетаданныеИсточник = Метаданные.Документы.Лико_ЗаявкаНаОтгрузку;   
	МетаданныеИсточникТЧ = Метаданные.Документы.Лико_ЗаявкаНаОтгрузку.ТабличныеЧасти["Товары"];
	
	МетаданныеНазначение= Метаданные.Справочники.Лико_ШаблоныЗаявокНаОтгрузку;  
	ШаблонЗаявкиНаОтгрузкуОбъект = Справочники.Лико_ШаблоныЗаявокНаОтгрузку.СоздатьЭлемент();
	
	Для Каждого Реквизит Из МетаданныеИсточник.Реквизиты Цикл
		Имя = Реквизит.Имя;
		Если МетаданныеНазначение.Реквизиты.Найти(Имя) <> Неопределено Тогда
			ШаблонЗаявкиНаОтгрузкуОбъект[Имя] = Объект[Имя];
		КонецЕсли;
	КонецЦикла; 
	
	Если Объект.Товары.Количество()>0 Тогда 
		Для каждого Реквизит из МетаданныеИсточникТЧ.Реквизиты Цикл
			Имя = Реквизит.Имя;
			Если МетаданныеНазначение.Реквизиты.Найти(Имя) <> Неопределено Тогда
				ШаблонЗаявкиНаОтгрузкуОбъект[Имя] = ПерваяСтрока[Имя];
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(ШаблонЗаявкиНаОтгрузкуОбъект.Контрагент) Тогда 
		ШаблонЗаявкиНаОтгрузкуОбъект.Партнер = ШаблонЗаявкиНаОтгрузкуОбъект.Контрагент.Партнер;
		ШаблонЗаявкиНаОтгрузкуОбъект.Наименование = СокрЛП(ШаблонЗаявкиНаОтгрузкуОбъект.Партнер) + ?(ЗначениеЗаполнено(ШаблонЗаявкиНаОтгрузкуОбъект.Город), " " + СокрЛП(ШаблонЗаявкиНаОтгрузкуОбъект.Город), "");
	КонецЕсли; 
	
	ШаблонЗаявкиНаОтгрузкуОбъект.Менеджер = ПараметрыСеанса.ТекущийПользователь;
	
	ШаблонЗаявкиНаОтгрузкуОбъект.Записать();
	Результат.Ссылка = ШаблонЗаявкиНаОтгрузкуОбъект.Ссылка;
	Возврат Результат;      
	
КонецФункции

&НаКлиенте
Процедура СоздатьШаблонЗаявкиНаОтгрузку(Команда)
	
	РезультатФункции = СоздатьШаблонЗаявкиНаОтгрузкуНаСервере();
	Если ЗначениеЗаполнено(РезультатФункции.Ссылка) Тогда
		ПараметрыФормы = новый Структура("Ключ", РезультатФункции.Ссылка);
		ОткрытьФорму("Справочник.Лико_ШаблоныЗаявокНаОтгрузку.Форма.ФормаЭлемента", ПараметрыФормы);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РезультатФункции.Сообщение) Тогда
		Сообщить(РезультатФункции.Сообщение);
	КонецЕсли;
	
КонецПроцедуры


ЗакрытиеФормы = Ложь;
ОтветилиНаВопросОРазличающихсяЗначениях = Ложь;
ВыбралиПричинуРазличающихсяЦен = Ложь;
